In [271]:
# 7.1 Handling Missing Data

In [3]:
import pandas as pd
import numpy as np

In [273]:
In [14]: float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [15]: float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [274]:
In [16]: float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [275]:
In [17]: string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [18]: string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [276]:
In [19]: string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [277]:
In [20]: float_data = pd.Series([1, 2, None], dtype='float64')

In [21]: float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [278]:
In [22]: float_data.isna()

0    False
1    False
2     True
dtype: bool

In [279]:
In [23]: data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [24]: data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [280]:
In [25]: data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [281]:
In [26]: data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
   ....:                      [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [27]: data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [282]:
In [28]: data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [283]:
In [29]: data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [284]:
In [30]: data[4] = np.nan

In [31]: data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [285]:
In [32]: data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [286]:
In [33]: df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [34]: df.iloc[:4, 1] = np.nan

In [35]: df.iloc[:2, 2] = np.nan

In [36]: df

          0         1         2
0 -2.230206       NaN       NaN
1  0.108137       NaN       NaN
2  1.631312       NaN  1.023040
3 -1.241426       NaN -0.498380
4  0.105425  2.091290  0.945499
5  0.569430  0.543451  0.620540
6  0.021871  2.594796  0.474243

In [287]:
In [37]: df.dropna()

          0         1         2
4  0.105425  2.091290  0.945499
5  0.569430  0.543451  0.620540
6  0.021871  2.594796  0.474243

In [288]:
In [38]: df.dropna(thresh=2)

          0         1         2
2  1.631312       NaN  1.023040
3 -1.241426       NaN -0.498380
4  0.105425  2.091290  0.945499
5  0.569430  0.543451  0.620540
6  0.021871  2.594796  0.474243

In [289]:
In [39]: df.fillna(0)

          0         1         2
0 -2.230206  0.000000  0.000000
1  0.108137  0.000000  0.000000
2  1.631312  0.000000  1.023040
3 -1.241426  0.000000 -0.498380
4  0.105425  2.091290  0.945499
5  0.569430  0.543451  0.620540
6  0.021871  2.594796  0.474243

In [290]:
In [40]: df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -2.230206  0.500000  0.000000
1  0.108137  0.500000  0.000000
2  1.631312  0.500000  1.023040
3 -1.241426  0.500000 -0.498380
4  0.105425  2.091290  0.945499
5  0.569430  0.543451  0.620540
6  0.021871  2.594796  0.474243

In [291]:
In [41]: df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [42]: df.iloc[2:, 1] = np.nan

In [43]: df.iloc[4:, 2] = np.nan

In [44]: df

          0         1         2
0 -0.406258 -1.439047 -0.394655
1  0.601585 -0.010305  1.811869
2 -0.134312       NaN  0.271141
3  0.848442       NaN -0.191932
4  0.488196       NaN       NaN
5  0.009411       NaN       NaN

In [292]:
In [45]: df.fillna(method="ffill")

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/3613593599.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0 -0.406258 -1.439047 -0.394655
1  0.601585 -0.010305  1.811869
2 -0.134312 -0.010305  0.271141
3  0.848442 -0.010305 -0.191932
4  0.488196 -0.010305 -0.191932
5  0.009411 -0.010305 -0.191932

In [293]:
In [46]: df.fillna(method="ffill", limit=2)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/630807030.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0 -0.406258 -1.439047 -0.394655
1  0.601585 -0.010305  1.811869
2 -0.134312 -0.010305  0.271141
3  0.848442 -0.010305 -0.191932
4  0.488196       NaN -0.191932
5  0.009411       NaN -0.191932

In [294]:
In [47]: data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [48]: data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [295]:
# 7.2 Data Transformation

In [296]:
In [49]: data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
   ....:                      "k2": [1, 1, 2, 3, 3, 4, 4]})

In [50]: data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [297]:
In [51]: data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [298]:
In [52]: data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [299]:
In [53]: data["v1"] = range(7)

In [54]: data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [300]:
In [55]: data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [301]:
In [56]: data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [302]:
In [57]: data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
   ....:                               "pastrami", "corned beef", "bacon",
   ....:                               "pastrami", "honey ham", "nova lox"],
   ....:                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [58]: data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [303]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [304]:
In [60]: data["animal"] = data["food"].map(meat_to_animal)

In [61]: data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [305]:
In [62]: def get_animal(x):
   ....:     return meat_to_animal[x]

In [63]: data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [306]:
In [64]: data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [65]: data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [307]:
In [66]: data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [308]:
In [67]: data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [309]:
In [68]: data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [310]:
In [69]: data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [311]:
In [70]: data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=["Ohio", "Colorado", "New York"],
   ....:                     columns=["one", "two", "three", "four"])

In [312]:
In [71]: def transform(x):
   ....:     return x[:4].upper()

In [72]: data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [313]:
In [73]: data.index = data.index.map(transform)

In [74]: data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [314]:
In [75]: data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [315]:
In [76]: data.rename(index={"OHIO": "INDIANA"},
   ....:             columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [316]:
In [77]: ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [317]:
In [78]: bins = [18, 25, 35, 60, 100]

In [79]: age_categories = pd.cut(ages, bins)

In [80]: age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [318]:
In [81]: age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [319]:
In [82]: age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [320]:
In [83]: age_categories.categories[0]

Interval(18, 25, closed='right')

In [321]:
In [84]: pd.value_counts(age_categories)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/918818084.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [322]:
In [85]: pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [323]:
In [86]: group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [87]: pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [324]:
In [88]: data = np.random.uniform(size=20)

In [89]: pd.cut(data, 4, precision=2)

[(0.046, 0.27], (0.5, 0.72], (0.5, 0.72], (0.5, 0.72], (0.5, 0.72], ..., (0.046, 0.27], (0.046, 0.27], (0.046, 0.27], (0.5, 0.72], (0.5, 0.72]]
Length: 20
Categories (4, interval[float64, right]): [(0.046, 0.27] < (0.27, 0.5] < (0.5, 0.72] < (0.72, 0.95]]

In [325]:
In [90]: data = np.random.standard_normal(1000)

In [91]: quartiles = pd.qcut(data, 4, precision=2)

In [92]: quartiles

[(0.69, 3.48], (-0.68, -0.028], (-3.4299999999999997, -0.68], (0.69, 3.48], (-0.028, 0.69], ..., (-3.4299999999999997, -0.68], (-0.68, -0.028], (-0.68, -0.028], (-0.68, -0.028], (-0.68, -0.028]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.4299999999999997, -0.68] < (-0.68, -0.028] < (-0.028, 0.69] < (0.69, 3.48]]

In [326]:
In [93]: pd.value_counts(quartiles)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/467165752.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.4299999999999997, -0.68]    250
(-0.68, -0.028]                 250
(-0.028, 0.69]                  250
(0.69, 3.48]                    250
Name: count, dtype: int64

In [327]:
In [94]: pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.424, -1.302]     100
(-1.302, -0.0282]    400
(-0.0282, 1.325]     400
(1.325, 3.481]       100
Name: count, dtype: int64

In [328]:
In [95]: data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [96]: data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.035016    -0.059670    -0.045356    -0.032493
std       0.992540     1.041457     1.047529     1.014335
min      -3.591325    -3.385656    -3.309309    -3.395676
25%      -0.677105    -0.791637    -0.752983    -0.714474
50%      -0.007232    -0.049198    -0.059422    -0.082671
75%       0.614972     0.698061     0.641009     0.635322
max       3.011629     3.339202     3.212670     3.283972

In [329]:
In [97]: col = data[2]

In [98]: col[col.abs() > 3]

323    3.212670
767   -3.309309
930   -3.233111
Name: 2, dtype: float64

In [330]:
In [99]: data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
93   0.187624 -3.385656 -0.153334  1.441867
204  0.974201 -3.004615 -0.808825 -0.774215
262 -1.773957 -3.278041  0.562008 -0.697083
323  0.050475 -0.191964  3.212670 -0.710328
397  0.101344  1.278806  0.179501 -3.268808
413 -3.179304  0.077614  0.021104 -0.797876
515 -0.020157 -3.138697 -1.792564  0.665849
528 -0.664265 -0.054515 -0.268115 -3.395676
593  3.011629  0.507438 -0.958237  0.223540
640 -1.188134 -3.267235 -0.807252  0.760852
662 -0.444325 -0.581267  0.440830 -3.021446
767  0.947081 -0.500830 -3.309309  0.999841
842  0.368734  1.415239  0.863850  3.283972
877  0.452464  3.339202 -0.761501 -1.806486
923 -3.591325  0.880392 -0.645991  1.689765
930  0.899597 -0.851738 -3.233111  0.868715
987 -3.028426 -0.815113 -1.626644 -2.045101

In [331]:
In [100]: data[data.abs() > 3] = np.sign(data) * 3

In [101]: data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.034228    -0.058935    -0.045026    -0.032091
std       0.989918     1.037207     1.045283     1.011319
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.677105    -0.791637    -0.752983    -0.714474
50%      -0.007232    -0.049198    -0.059422    -0.082671
75%       0.614972     0.698061     0.641009     0.635322
max       3.000000     3.000000     3.000000     3.000000

In [332]:
In [102]: np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1 -1.0  1.0 -1.0 -1.0
2  1.0 -1.0  1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0 -1.0  1.0  1.0

In [333]:
In [103]: df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

In [104]: df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [334]:
In [105]: sampler = np.random.permutation(5)

In [106]: sampler

array([1, 2, 3, 4, 0])

In [335]:
In [107]: df.take(sampler)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [336]:
In [108]: df.iloc[sampler]

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [337]:
In [109]: column_sampler = np.random.permutation(7)

In [110]: column_sampler

array([5, 0, 4, 1, 3, 6, 2])

In [338]:
In [111]: df.take(column_sampler, axis="columns")

    5   0   4   1   3   6   2
0   5   0   4   1   3   6   2
1  12   7  11   8  10  13   9
2  19  14  18  15  17  20  16
3  26  21  25  22  24  27  23
4  33  28  32  29  31  34  30

In [339]:
In [112]: df.sample(n=3)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13

In [340]:
In [113]: choices = pd.Series([5, 7, -1, 6, 4])

In [114]: choices.sample(n=10, replace=True)

3    6
0    5
4    4
4    4
2   -1
3    6
2   -1
4    4
1    7
1    7
dtype: int64

In [341]:
In [115]: df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
   .....:                    "data1": range(6)})

In [116]: df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [342]:
In [117]: pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [343]:
In [118]: dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)

In [119]: df_with_dummy = df[["data1"]].join(dummies)

In [120]: df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [4]:
In [121]: mnames = ["movie_id", "title", "genres"]

In [122]: movies = pd.read_table("examples/movies.dat", sep="::",
   .....:                        header=None, names=mnames, engine="python")

In [123]: movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [ ]:
In [124]: dummies = movies["genres"].str.get_dummies("|")

In [125]: dummies.iloc[:10, :6]

In [ ]:
In [126]: movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [127]: movies_windic.iloc[0]

In [ ]:
In [128]: np.random.seed(12345) # to make the example repeatable

In [129]: values = np.random.uniform(size=10)

In [130]: values

In [ ]:
In [131]: bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [132]: pd.get_dummies(pd.cut(values, bins))

In [ ]:
# 7.3 Extension Data Types

In [ ]:
In [133]: s = pd.Series([1, 2, 3, None])

In [134]: s

In [ ]:
In [135]: s.dtype

In [ ]:
In [136]: s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())

In [137]: s

In [ ]:
In [138]: s.isna()

In [ ]:
In [139]: s.dtype

In [ ]:
In [140]: s[3]

In [ ]:
In [141]: s[3] is pd.NA

In [ ]:
In [142]: s = pd.Series([1, 2, 3, None], dtype="Int64")

In [ ]:
In [143]: s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())

In [144]: s

In [ ]:
In [145]: df = pd.DataFrame({"A": [1, 2, None, 4],
   .....:                    "B": ["one", "two", "three", None],
   .....:                    "C": [False, None, False, True]})

In [146]: df

In [ ]:
In [147]: df["A"] = df["A"].astype("Int64")

In [148]: df["B"] = df["B"].astype("string")

In [149]: df["C"] = df["C"].astype("boolean")

In [150]: df

In [ ]:
# 7.4 String Manipulation

In [ ]:
In [151]: val = "a,b,  guido"

In [152]: val.split(",")

In [ ]:
In [153]: pieces = [x.strip() for x in val.split(",")]

In [154]: pieces

In [ ]:
In [155]: first, second, third = pieces

In [156]: first + "::" + second + "::" + third

In [ ]:
In [157]: "::".join(pieces)

In [ ]:
In [158]: "guido" in val

In [ ]:
In [159]: val.index(",")

In [ ]:
In [160]: val.find(":")

In [ ]:
In [161]: val.index(":")

In [ ]:
In [162]: val.count(",")

In [ ]:
In [163]: val.replace(",", "::")

In [ ]:
In [164]: val.replace(",", "")

In [ ]:
In [165]: import re

In [166]: text = "foo    bar\t baz  \tqux"

In [167]: re.split(r"\s+", text)

In [ ]:
In [168]: regex = re.compile(r"\s+")

In [169]: regex.split(text)

In [ ]:
In [170]: regex.findall(text)

In [ ]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
In [172]: regex.findall(text)

In [ ]:
In [173]: m = regex.search(text)

In [174]: m

In [ ]:
In [175]: text[m.start():m.end()]

In [ ]:
In [176]: print(regex.match(text))

In [ ]:
In [177]: print(regex.sub("REDACTED", text))

In [ ]:
In [178]: pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [179]: regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
In [180]: m = regex.match("wesm@bright.net")

In [181]: m.groups()

In [ ]:
In [182]: regex.findall(text)

In [ ]:
In [183]: print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

In [ ]:
In [184]: data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
   .....:         "Rob": "rob@gmail.com", "Wes": np.nan}

In [185]: data = pd.Series(data)

In [186]: data

In [ ]:
In [187]: data.isna()

In [ ]:
In [188]: data.str.contains("gmail")

In [ ]:
In [189]: data_as_string_ext = data.astype('string')

In [190]: data_as_string_ext

In [ ]:
In [191]: data_as_string_ext.str.contains("gmail")

In [ ]:
In [192]: pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [193]: data.str.findall(pattern, flags=re.IGNORECASE)

In [ ]:
In [194]: matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [195]: matches

In [ ]:
In [196]: matches.str.get(1)

In [ ]:
In [197]: data.str[:5]

In [ ]:
In [198]: data.str.extract(pattern, flags=re.IGNORECASE)

In [ ]:
# 7.5 Categorical Data

In [ ]:
In [199]: values = pd.Series(['apple', 'orange', 'apple',
   .....:                     'apple'] * 2)

In [200]: values

In [ ]:
In [201]: pd.unique(values)

In [ ]:
In [202]: pd.value_counts(values)

In [ ]:
In [203]: values = pd.Series([0, 1, 0, 0] * 2)

In [204]: dim = pd.Series(['apple', 'orange'])

In [205]: values

In [ ]:
In [206]: dim

In [ ]:
In [207]: dim.take(values)

In [ ]:
In [208]: fruits = ['apple', 'orange', 'apple', 'apple'] * 2

In [209]: N = len(fruits)

In [210]: rng = np.random.default_rng(seed=12345)

In [211]: df = pd.DataFrame({'fruit': fruits,
   .....:                    'basket_id': np.arange(N),
   .....:                    'count': rng.integers(3, 15, size=N),
   .....:                    'weight': rng.uniform(0, 4, size=N)},
   .....:                   columns=['basket_id', 'fruit', 'count', 'weight'])

In [212]: df

In [ ]:
In [213]: fruit_cat = df['fruit'].astype('category')

In [214]: fruit_cat

In [ ]:
In [215]: c = fruit_cat.array

In [216]: type(c)

In [ ]:
In [217]: c.categories

In [ ]:
In [219]: dict(enumerate(c.categories))

In [ ]:
In [220]: df['fruit'] = df['fruit'].astype('category')

In [221]: df["fruit"]

In [ ]:
In [222]: my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])

In [223]: my_categories

In [ ]:
In [224]: categories = ['foo', 'bar', 'baz']

In [225]: codes = [0, 1, 2, 0, 0, 1]

In [226]: my_cats_2 = pd.Categorical.from_codes(codes, categories)

In [227]: my_cats_2

In [ ]:
In [228]: ordered_cat = pd.Categorical.from_codes(codes, categories,
   .....:                                         ordered=True)

In [229]: ordered_cat

In [ ]:
In [230]: my_cats_2.as_ordered()

In [ ]:
In [231]: rng = np.random.default_rng(seed=12345)

In [232]: draws = rng.standard_normal(1000)

In [233]: draws[:5]

In [ ]:
In [234]: bins = pd.qcut(draws, 4)

In [235]: bins

In [ ]:
In [236]: bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])

In [237]: bins

In [ ]:
In [238]: bins.codes[:10]

In [ ]:
In [239]: bins = pd.Series(bins, name='quartile')

In [240]: results = (pd.Series(draws)
   .....:            .groupby(bins)
   .....:            .agg(['count', 'min', 'max'])
   .....:            .reset_index())

In [241]: results

In [ ]:
In [242]: results['quartile']

In [ ]:
In [243]: N = 10_000_000

In [244]: labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [245]: categories = labels.astype('category')

In [ ]:
In [246]: labels.memory_usage(deep=True)

In [ ]:
In [247]: categories.memory_usage(deep=True)

In [ ]:
In [248]: %time _ = labels.astype('category')

In [ ]:
In [249]: %timeit labels.value_counts()

In [ ]:
In [250]: %timeit categories.value_counts()

In [ ]:
In [251]: s = pd.Series(['a', 'b', 'c', 'd'] * 2)

In [252]: cat_s = s.astype('category')

In [253]: cat_s

In [ ]:
In [254]: cat_s.cat.codes

In [ ]:
In [255]: cat_s.cat.categories

In [ ]:
In [256]: actual_categories = ['a', 'b', 'c', 'd', 'e']

In [257]: cat_s2 = cat_s.cat.set_categories(actual_categories)

In [258]: cat_s2

In [ ]:
In [259]: cat_s.value_counts()

In [ ]:
In [260]: cat_s2.value_counts()

In [ ]:
In [261]: cat_s3 = cat_s[cat_s.isin(['a', 'b'])]

In [262]: cat_s3

In [ ]:
In [263]: cat_s3.cat.remove_unused_categories()

In [ ]:
In [264]: cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [ ]:
In [265]: pd.get_dummies(cat_s, dtype=float)